10/data/attachments/9c6650d4c7630d27.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Marcus_late_Friend_99885_3</nif:username>
            <nif:friendToBeRequested>soap_friends_13104b59-5eae-48e4-b3f4-b08c7f84fd6e</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>